AlmoedAli/STM32LAB1/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define red1_Pin GPIO_PIN_0
#define red1_GPIO_Port GPIOA
#define green1_Pin GPIO_PIN_1
#define green1_GPIO_Port GPIOA
#define yellow1_Pin GPIO_PIN_2
#define yellow1_GPIO_Port GPIOA
#define led1A_Pin GPIO_PIN_3
#define led1A_GPIO_Port GPIOA
#define led1B_Pin GPIO_PIN_4
#define led1B_GPIO_Port GPIOA
#define led1C_Pin GPIO_PIN_5
#define led1C_GPIO_Port GPIOA
#define led1D_Pin GPIO_PIN_6
#define led1D_GPIO_Port GPIOA
#define led1E_Pin GPIO_PIN_7
#define led1E_GPIO_Port GPIOA
#define red2_Pin GPIO_PIN_0
#define red2_GPIO_Port GPIOB
#define green2_Pin GPIO_PIN_1
#define green2_GPIO_Port GPIOB
#define yellow2_Pin GPIO_PIN_2
#define yellow2_GPIO_Port GPIOB
#define led1F_Pin GPIO_PIN_8
#define led1F_GPIO_Port GPIOA
#define led1G_Pin GPIO_PIN_9
#define led1G_GPIO_Port GPIOA
#define led2A_Pin GPIO_PIN_3
#define led2A_GPIO_Port GPIOB
#define led2B_Pin GPIO_PIN_4
#define led2B_GPIO_Port GPIOB
#define led2C_Pin GPIO_PIN_5
#define led2C_GPIO_Port GPIOB
#define led2D_Pin GPIO_PIN_6
#define led2D_GPIO_Port GPIOB
#define led2E_Pin GPIO_PIN_7
#define led2E_GPIO_Port GPIOB
#define led2F_Pin GPIO_PIN_8
#define led2F_GPIO_Port GPIOB
#define led2G_Pin GPIO_PIN_9
#define led2G_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
